score={
    'NNG':0,    #보통명사
    'NNP':0,    #고유명사
    'NNB':1,    #일반의존명사       "것,뿐,만..."
    'NNM':2,    #단위의존명사       ",개,미터..."
    'NR' :-1,#1 #수사               "첫째,일,하루,일주일,하나..."      
    'NP' :2,    #대명사             "나,너,저..."
    'VV' :0,    #동사
    'VA' :1,    #형용사
    'VXV':2,    #보조동사           "-하다,-보다,-아니하다..."
    'VXA':2,    #보조형용사         "-척하다,-싶다,..."
    'VCP':-1,#0 #긍정지정사         "이다"
    'VCN':-1,#0 #부정지정사         "아니다"
    'MDT':1,    #일반관형사         "새,헌,오른,윗,..."
    'MDN':1,    #수관형사           "한, 두,..."
    'MAG':1,    #일반부사           "잘,빨리,너무,..."
    'MAC':-1,#2 #접속부사           "그러나,그런데,..."
    'IC' :1,    #감탄사
    'JKS':-1,#2 #주격조사           "이/가,께서,에서"
    'JKC':3,    #보격조사           "이/가"
    'JKG':1,    #관형격조사         "의"
    'JKO':-1,#2 #목적격조사         "을/를/-ㄹ"
    'JKM':-1,#1 #부사격조사         "에게,에서,보다,와,에,같이..."
    'JKI':-1,#0 #호격조사           "아/야,여/이여,이시여"
    'JKQ':-1,#2 #인용격조사         "고,라고"      
    'JX' :-1,#1 #보조사             "부터,까지,대로,..."
    'JC' :2,    #접속조사           "와/과,하고,이다,이며,에다(가),(이)랑"
    'EPH':3,    #존칭선어말어미      "-시-"
    'EPT':-1,#1 #시제선어말어미      "-았었-,-았던,-았을-,..."
    'EPP':3,    #공손선어말어미      "-오-,-사옵-,..."
    'EFN':-1,#0 #평서형종결어미      "-다,-네,-을걸,..."
    'EFQ':-1,#0 #의문형종결어미      "-니,-는가,-련,..."
    'EFO':-1,#0 #명령형종결어미      "-아라,-게,-시오,..."
    'EFA':-1,#0 #청유형종결어미      "-자,-세,-ㅂ시다,..."
    'EFI':-1,#0 #감탄형종결어미      "-구나,-군,-어라,..."
    'EFR':-1,#0 #존칭형종결어미      "-읍니다,-십시오,..." #종결어미 구분 잘 못함. 묶어서 해야할 듯
    'ECE':1,    #대등연결어미        "-고,-(으)며,-(으)나,..."
    'ECD':1,    #의존적연결어미      "-아서/어서,-(으)면,-(으)니까,..."
    'ECS':1,    #보조적연결어미      "-아/어,-게,-지,-고" #특수 경우 -아/어에 대한 고려 해야함.
    'ETN':0,    #명사형전성어미      "-(으)ㅁ,-기"
    'ETD':-1,#0 #관형형전성어미      "-(으)ㄴ,-는,-(으)ㄹ,-던"
    'XPN':0,    #체언접두사          "맏-,맨-,숫-,..."
    'XPV':0,    #용언접두사          "엇-,헛-,되-,..."
    'XSN':0,    #명사파생접미사      "-(으)ㅁ,-기, -이,..."(단어를 만듦)
    'XSV':0,    #동사파생접미사      "-이-,-히-,-거리-,-대-,..."
    'XSA':0,    #형용사파생접미사    "-답,-롭,-스럽,...""
    'XR' :0,    #어근               "갈,먹,띄,..."
    'SF' :0,    #.?!
    'SP' :0,    #,:/
    'SS' :0,    #""(){}
    'SE' :0,    #...
    'SO' :0,    #~-
    'SW' :0,    #<>$
    'UN' :0,    #명사추정범주        "분류 안된것"
    'OL' :0,    #외국어
    'OH' :0,    #한자
    'ON' :0,    #숫자               "수사, 수관형사와 묶음"마리
    'BLK':0     #공백
}

def except_case(morp,typ):
    if typ == 'NR':
        pass